---
kind: property
id: P:Autodesk.Revit.DB.ParameterTypeId.AlwaysZeroLength
source: html/be3c0e11-b6c1-3de2-d1d8-42d33abafab5.htm
---
# Autodesk.Revit.DB.ParameterTypeId.AlwaysZeroLength Property

"Base Offset"

## Syntax (C#)
```csharp
public static ForgeTypeId AlwaysZeroLength { get; }
```